; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	spectrograph0 - mode
	image1 - mode
	image2 - mode
	GroundStation1 - direction
	GroundStation6 - direction
	Star14 - direction
	GroundStation9 - direction
	Star12 - direction
	Star11 - direction
	Star3 - direction
	GroundStation5 - direction
	Star8 - direction
	Star2 - direction
	Star13 - direction
	Star7 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	Star10 - direction
	Planet15 - direction
	Planet16 - direction
	Phenomenon17 - direction
	Planet18 - direction
	Planet19 - direction
	Star20 - direction
	Star21 - direction
	Star22 - direction
	Planet23 - direction
	Planet24 - direction
	Star25 - direction
	Star26 - direction
	Star27 - direction
	Planet28 - direction
	Phenomenon29 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 image2)
	(calibration_target instrument0 Star10)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 GroundStation9)
	(calibration_target instrument0 Star14)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star11)
	(supports instrument1 spectrograph0)
	(supports instrument1 image1)
	(calibration_target instrument1 Star12)
	(calibration_target instrument1 Star8)
	(calibration_target instrument1 Star3)
	(supports instrument2 image2)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 Star10)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 Star7)
	(calibration_target instrument2 Star11)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star11)
	(supports instrument3 image1)
	(supports instrument3 image2)
	(calibration_target instrument3 Star8)
	(calibration_target instrument3 GroundStation5)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 Star3)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star3)
	(supports instrument4 image1)
	(supports instrument4 image2)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 Star2)
	(calibration_target instrument4 Star7)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation0)
	(calibration_target instrument5 Star7)
	(calibration_target instrument5 GroundStation4)
	(calibration_target instrument5 Star13)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 Star10)
	(calibration_target instrument6 GroundStation0)
	(calibration_target instrument6 GroundStation4)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star20)
)
(:goal (and
	(pointing satellite0 GroundStation6)
	(have_image Planet15 spectrograph0)
	(have_image Planet16 spectrograph0)
	(have_image Phenomenon17 image2)
	(have_image Planet18 spectrograph0)
	(have_image Planet19 spectrograph0)
	(have_image Star20 image1)
	(have_image Star21 image2)
	(have_image Star22 spectrograph0)
	(have_image Planet23 spectrograph0)
	(have_image Planet24 spectrograph0)
	(have_image Star25 spectrograph0)
	(have_image Star26 image2)
	(have_image Star27 image1)
	(have_image Planet28 image1)
	(have_image Phenomenon29 image2)
))

)

; plan
1. (turn_to satellite3 star2 star20)
   deleted: (pointing satellite3 star20)
   added: (pointing satellite3 star2)
   goals met: 0 of 16
2. (switch_on instrument4 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument4)
   goals met: 0 of 16
3. (calibrate satellite3 instrument4 star2)
   added: (calibrated instrument4)
   goals met: 0 of 16
4. (turn_to satellite3 planet18 star2)
   deleted: (pointing satellite3 star2)
   added: (pointing satellite3 planet18)
   goals met: 0 of 16
5. (take_image satellite3 planet18 instrument4 spectrograph0)
   added: (have_image planet18 spectrograph0)
   goals met: 1 of 16
6. (turn_to satellite3 planet16 planet18)
   deleted: (pointing satellite3 planet18)
   added: (pointing satellite3 planet16)
   goals met: 1 of 16
7. (take_image satellite3 planet16 instrument4 spectrograph0)
   added: (have_image planet16 spectrograph0)
   goals met: 2 of 16
8. (turn_to satellite3 planet15 planet16)
   deleted: (pointing satellite3 planet16)
   added: (pointing satellite3 planet15)
   goals met: 2 of 16
9. (take_image satellite3 planet15 instrument4 spectrograph0)
   added: (have_image planet15 spectrograph0)
   goals met: 3 of 16
10. (turn_to satellite3 phenomenon29 planet15)
   deleted: (pointing satellite3 planet15)
   added: (pointing satellite3 phenomenon29)
   goals met: 3 of 16
11. (take_image satellite3 phenomenon29 instrument4 image2)
   added: (have_image phenomenon29 image2)
   goals met: 4 of 16
12. (turn_to satellite3 phenomenon17 phenomenon29)
   deleted: (pointing satellite3 phenomenon29)
   added: (pointing satellite3 phenomenon17)
   goals met: 4 of 16
13. (turn_to satellite0 groundstation6 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 groundstation6)
   goals met: 5 of 16
14. (take_image satellite3 phenomenon17 instrument4 image2)
   added: (have_image phenomenon17 image2)
   goals met: 6 of 16
15. (turn_to satellite3 planet19 phenomenon17)
   deleted: (pointing satellite3 phenomenon17)
   added: (pointing satellite3 planet19)
   goals met: 6 of 16
16. (take_image satellite3 planet19 instrument4 spectrograph0)
   added: (have_image planet19 spectrograph0)
   goals met: 7 of 16
17. (turn_to satellite3 planet23 planet19)
   deleted: (pointing satellite3 planet19)
   added: (pointing satellite3 planet23)
   goals met: 7 of 16
18. (take_image satellite3 planet23 instrument4 spectrograph0)
   added: (have_image planet23 spectrograph0)
   goals met: 8 of 16
19. (turn_to satellite3 planet24 planet23)
   deleted: (pointing satellite3 planet23)
   added: (pointing satellite3 planet24)
   goals met: 8 of 16
20. (take_image satellite3 planet24 instrument4 spectrograph0)
   added: (have_image planet24 spectrograph0)
   goals met: 9 of 16
21. (turn_to satellite3 planet28 planet24)
   deleted: (pointing satellite3 planet24)
   added: (pointing satellite3 planet28)
   goals met: 9 of 16
22. (take_image satellite3 planet28 instrument4 image1)
   added: (have_image planet28 image1)
   goals met: 10 of 16
23. (turn_to satellite3 star20 planet28)
   deleted: (pointing satellite3 planet28)
   added: (pointing satellite3 star20)
   goals met: 10 of 16
24. (take_image satellite3 star20 instrument4 image1)
   added: (have_image star20 image1)
   goals met: 11 of 16
25. (turn_to satellite3 star21 star20)
   deleted: (pointing satellite3 star20)
   added: (pointing satellite3 star21)
   goals met: 11 of 16
26. (take_image satellite3 star21 instrument4 image2)
   added: (have_image star21 image2)
   goals met: 12 of 16
27. (turn_to satellite3 star22 star21)
   deleted: (pointing satellite3 star21)
   added: (pointing satellite3 star22)
   goals met: 12 of 16
28. (take_image satellite3 star22 instrument4 spectrograph0)
   added: (have_image star22 spectrograph0)
   goals met: 13 of 16
29. (turn_to satellite3 star25 star22)
   deleted: (pointing satellite3 star22)
   added: (pointing satellite3 star25)
   goals met: 13 of 16
30. (take_image satellite3 star25 instrument4 spectrograph0)
   added: (have_image star25 spectrograph0)
   goals met: 14 of 16
31. (turn_to satellite3 star26 star25)
   deleted: (pointing satellite3 star25)
   added: (pointing satellite3 star26)
   goals met: 14 of 16
32. (take_image satellite3 star26 instrument4 image2)
   added: (have_image star26 image2)
   goals met: 15 of 16
33. (turn_to satellite3 star27 star26)
   deleted: (pointing satellite3 star26)
   added: (pointing satellite3 star27)
   goals met: 15 of 16
34. (take_image satellite3 star27 instrument4 image1)
   added: (have_image star27 image1)
   goals met: 16 of 16
